# Basics
brew "mas"
brew "stow"

# Terminal and shell upgrades
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
# brew "starship"
cask "font-fira-code-nerd-font"

# Self-hosting and cross-platform
cask "syncthing-app"
cask "signal"
mas "Infuse", id: 1136220934

# Apps
# brew "opencode"
cask "obsidian"

# VMs and containers
tap "apple/apple"
brew "container"
cask "virtualbuddy"

# Sysadmin
cask "tailscale-app" if system("pmset -g batt 2>/dev/null | grep -q 'Battery'")
mas "Apple Configurator", id: 1037126344
mas "Remote Desktop", id: 409907375

# Safari extensions
mas "Baking Soda", id: 1601151613
mas "Vinegar", id: 1591303229
