brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"

# self-hosting or replacements to Apple services
cask "syncthing-app"
cask "signal"

cask "font-fira-code-nerd-font"
cask "virtualbuddy"

# laptops
cask "tailscale-app" if system("pmset -g batt 2>/dev/null | grep -q 'Battery'")

brew "container"
brew "lazycontainer"
